{
  "home": {
    "mainTitle": "Webpack Starter Kit",
    "description": "Легка, потужна та готова до продакшн збірка для створення сучасних статичних вебсайтів. Побудована на Pug, SCSS та ES6+",
    "viewRepository": "Переглянути на GitHub",
    "viewGuide": "Переглянути Style Guide",
    "blocks": {
      "webpack": {
        "title": "Webpack 5",
        "description": "Повністю налаштована збірка Webpack із підтримкою Hot Module Replacement (HMR) для швидкого процесу розробки."
      },
      "pug": {
        "title": "Pug Шаблони",
        "description": "Пишіть чистіший HTML за допомогою Pug (раніше Jade). Є підтримка успадкування макетів, міксинів та змінних."
      },
      "theming": {
        "title": "SCSS та Темізація",
        "description": "Вбудована підтримка SASS/SCSS. Містить гнучку систему сітки та CSS‑змінні для легкого перемикання між світлою та темною темою."
      },
      "js": {
        "title": "JavaScript ES6+",
        "description": "Сучасна підтримка JavaScript через Babel. Зручно пишіть модульний код, використовуючи імпорти та експорти ES6."
      },
      "asset": {
        "title": "Керування ресурсами",
        "description": "Автоматична обробка зображень, шрифтів та статичних файлів. Оптимізовано для продакшн‑збірок."
      },
      "architecture": {
        "title": "Чиста Архітектура",
        "description": "Організована структура папок із розділенням логіки, стилів та шаблонів. Масштабована для малих та середніх проєктів."
      }
    }
  },
  "grid": {
    "title": "Сітка",
    "blocks": {
      "basic": {
        "title": "1. Базова сітка",
        "description": "Два стовпці ділять ряд порівну. Кожен .col-6 займає половину з 12‑колонок, тому макет показує два рівні блоки поруч.",
        "columnText": "Лівий стовпець (6/12)"
      },
      "responsive": {
        "title": "2. Приклад адаптивності",
        "description": "Стовпці підлаштовуються під розмір екрана. На малих екранах кожен блок використовує .col-12 і займає всю ширину. На середніх і більших екранах .col-md-6 робить їх половинної ширини, тому вони розташовуються поруч.",
        "columnText": "Повна ширина на мобільному, половина на десктопі"
      },
      "columns": {
        "title": "3. Три стовпці",
        "description": "Три рівні стовпці в одному ряду. Кожен .col-4 займає чотири з дванадцяти колонок, утворюючи три рівні блоки по всій ширині ряду.",
        "columnText1": "Стовпець 1",
        "columnText2": "Стовпець 2",
        "columnText3": "Стовпець 3"
      },
      "width": {
        "title": "4. Стовпець на всю ширину",
        "description": "Один блок займає весь ряд. Використання .col-full застосовує grid-column: 1 / -1, тому елемент розтягується на всі доступні колонки.",
        "columnText": "Цей div займає всі 12 колонок"
      },
      "offset": {
        "title": "5. Приклад відступу",
        "description": "Стовпець зміщений вправо. .col-4 визначає ширину, а .offset-2 додає лівий відступ, рівний двом колонкам, створюючи простір перед блоком.",
        "columnText": "Зміщено на 2 колонки"
      },
      "reOffset": {
        "title": "6. Адаптивний відступ",
        "description": "Відступ застосовується лише на більших екранах. На мобільному блок має .col-6 (половина ширини). На середніх екранах і вище він стає .col-md-4 з .offset-md-2, тому зміщується вправо на дві колонки, залишаючись вужчим.",
        "columnText": "Адаптивний відступ: на десктопі зміщено на 2 колонки"
      }
    }
  }
}
